import random
import time

board1_1 = [
    ['r', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', 'p', '.', 'p', '.', 'p', '.', 'p'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', 'P', '.', 'P'],
    ['.', 'C', '.', '.', '.', '.', '.', 'C', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', 'N', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_2 = [
    ['r', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', 'p', '.', 'p', '.', 'p', '.', 'p'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', '.', '.', '.', '.', '.', 'C', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', 'N', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_3 = [
    ['r', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', '.', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', '.', '.', '.', '.', '.', 'C', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', 'N', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_4 = [
    ['r', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', '.', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', 'N', '.', '.', '.', '.', 'C', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', '.', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_5 = [
    ['.', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['r', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', '.', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', 'N', '.', '.', '.', '.', 'C', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', '.', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_6 = [
    ['.', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['r', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', 'C', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', 'N', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', '.', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_7 = [
    ['.', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', 'r', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', 'C', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', 'N', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', '.', 'B', 'A', 'K', 'A', 'B', 'N', 'R']
]
board1_8 = [
    ['.', 'n', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', 'r', '.', '.', '.', '.', '.'],
    ['.', 'c', '.', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', 'C', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', 'N', '.', '.', '.', 'N', '.', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', '.', 'B', 'A', 'K', 'A', 'B', '.', 'R']
]
board1_9 = [
    ['.', '.', 'b', 'a', 'k', 'a', 'b', 'n', 'r'],
    ['.', '.', '.', 'r', '.', '.', '.', '.', '.'],
    ['.', 'c', 'n', '.', '.', '.', '.', 'c', '.'],
    ['p', '.', '.', '.', 'p', '.', 'p', 'C', 'p'],
    ['.', '.', 'p', '.', '.', '.', '.', '.', '.'],
    ['.', '.', '.', '.', '.', '.', 'P', '.', '.'],
    ['P', '.', 'P', '.', 'P', '.', '.', '.', 'P'],
    ['.', 'C', 'N', '.', '.', '.', 'N', '.', '.'],
    ['.', '.', '.', '.', '.', '.', '.', '.', '.'],
    ['R', '.', 'B', 'A', 'K', 'A', 'B', '.', 'R']
]

board1_list = [board1_1, board1_2, board1_3, board1_4, board1_5, board1_6, board1_7, board1_8, board1_9]
                

def get_changes(changes):
    former_id = None
    current_id = None
    for change in changes:
        (i, j), old, new = change
        if old == 'r' and new == 'b':
            current_id = (i, j)
        elif old == 'b' and new == 'r':
            current_id = (i, j)
        if old != '.' and new == '.':
            # print(f"元素 '{old}' 从位置 ({i}, {j}) 移动了")
            former_id = (i, j)
        elif old == '.' and new != '.':
            # print(f"元素 '{new}' 出现在新位置 ({i}, {j})")
            current_id = (i, j)

    return former_id, current_id

def find_changes(former, current):
    changes = []
    for i in range(len(former)):
        for j in range(len(former[i])):
            if former[i][j] != current[i][j]:
                changes.append(((i, j), former[i][j], current[i][j]))
    return changes

def board_to_fen(board):
    fen = ""
    for row in board:
        empty_count = 0
        for piece in row:
            if piece == '.':
                empty_count += 1
            else:
                if empty_count > 0:
                    fen += str(empty_count)
                    empty_count = 0
                fen += piece
        if empty_count > 0:
            fen += str(empty_count)
        fen += "/"

    return fen[:-1]


def write_data(data):
    # 写入命名管道
    with open('/tmp/mypipe', 'w') as pipe:
        pipe.write(data)

former_board = []

msg = [
    "一二三四五六七八九十",
    "一二三四五六七八九十一二三四五六七八九十",
    "一二三四五六七八九十",
    "一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十",
    "一二三四五六七八九十",
    "一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十",
    "一二三四五六七八九十",
    "一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十一二三四五六七八九十",
    "一二三四五六七八九十",
]

for board in board1_list:
    
    fen = board_to_fen(board)
    if len(former_board) == 0:
        former_board = board
    else:
        changes = find_changes(former_board, board)
        former_id, current_id = get_changes(changes)
        fen += " " + str(former_id[0]) + str(former_id[1]) + str(current_id[0]) + str(current_id[1]) + " " + msg[board1_list.index(board)]
        print(fen)
        write_data(fen)
        former_board = board
        random_number = random.uniform(3, 5)
        random_number = round(random_number, 1)
        time.sleep(random_number)

write_data("")
